"""

1. Создайте два класса: Person — хранит общую информацию о людях — имя, профессия, зарплата; класс Manager — специализированный производный класс. В классе Person создайте свою версию для стандартной встроенной функции str.

2. Реализовать класс со своей операцией сложения. Например класс точка с 3-мя координатами. Сложение - сложение соответствующих координат.

3. Реализовать класс который будет:

3.a читать из ввода строку

3.b проверять, что строка состоит только из скобочек “{}[]()<>”

3.c проверять, что строка является правильной скобочной последовательностью - выводить вердикт

4. У вас несколько JSON файлов. В каждом из этих файлов есть произвольная структура данных. Вам необходимо написать класс который будет описывать работу с этими файлами, а именно:

4.a запись в файл

4.b чтение из файла

4.c объединение данных из файлов в новый файл

4.d получить относительный путь к файлу

4.e получить абсолютный путь к файлу

"""